ranjithaguna/pv/LED_Demo/source/pic32cx/component/capture_compare_timer.h
typedef union
{
  struct
  {
    uint32_t CAPTURE_EDGE4:2;           /**< bit:   0..1  This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 4. */
    uint32_t FILTER_BYP4:1;             /**< bit:      2  This bit enables bypassing the input noise filter for Capture Register 4, so that the input signal goes directly into the timer. */
    uint32_t :2;                        /**< bit:   3..4  Reserved                                      */
    uint32_t FCLK_SEL4:3;               /**< bit:   5..7  This 3-bit field sets the clock source for the input filter for Capture Register 4. */
    uint32_t CAPTURE_EDGE5:2;           /**< bit:   8..9  This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 5. */
    uint32_t FILTER_BYP5:1;             /**< bit:     10  This bit enables bypassing the input noise filter for Capture Register 5, so that the input signal goes directly into the timer. */
    uint32_t :2;                        /**< bit: 11..12  Reserved                                      */
    uint32_t FCLK_SEL5:3;               /**< bit: 13..15  This 3-bit field sets the clock source for the input filter for Capture Register 5. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_bits_t;
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This register is used to configure capture and compare timers 4-5.  Reset Value */

#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE4_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 4. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE4_Msk (0x3U << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE4_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 4. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE4(value) (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE4_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE4_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FILTER_BYP4_Pos (2)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This bit enables bypassing the input noise filter for Capture Register 4, so that the input signal goes directly into the timer. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FILTER_BYP4_Msk (0x1U << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FILTER_BYP4_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This bit enables bypassing the input noise filter for Capture Register 4, so that the input signal goes directly into the timer. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL4_Pos (5)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This 3-bit field sets the clock source for the input filter for Capture Register 4. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL4_Msk (0x7U << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL4_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This 3-bit field sets the clock source for the input filter for Capture Register 4. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL4(value) (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL4_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL4_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE5_Pos (8)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 5. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE5_Msk (0x3U << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE5_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 5. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE5(value) (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE5_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_CAPTURE_EDGE5_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FILTER_BYP5_Pos (10)                                           /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This bit enables bypassing the input noise filter for Capture Register 5, so that the input signal goes directly into the timer. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FILTER_BYP5_Msk (0x1U << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FILTER_BYP5_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This bit enables bypassing the input noise filter for Capture Register 5, so that the input signal goes directly into the timer. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL5_Pos (13)                                           /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This 3-bit field sets the clock source for the input filter for Capture Register 5. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL5_Msk (0x7U << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL5_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This 3-bit field sets the clock source for the input filter for Capture Register 5. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL5(value) (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL5_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_FCLK_SEL5_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_Msk (0x0000E7E7UL)                                 /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER : (CAPTURE_COMPARE_TIMER Offset: 0x0c) (R/W 32) This register contains the current value of the Free Running Timer. -------- */

typedef union
{
  struct
  {
    uint32_t FREE_RUNNING_TIMER:32;     /**< bit:  0..31  This register contains the current value of the Free Running Timer. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_bits_t;
#define CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER) This register contains the current value of the Free Running Timer.  Reset Value */

#define CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_FREE_RUNNING_TIMER_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER) This register contains the current value of the Free Running Timer. Position */
#define CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_FREE_RUNNING_TIMER_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_FREE_RUNNING_TIMER_Pos)  /**< (CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER) This register contains the current value of the Free Running Timer. Mask */
#define CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_FREE_RUNNING_TIMER(value) (CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_FREE_RUNNING_TIMER_Msk & ((value) << CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_FREE_RUNNING_TIMER_Pos))
#define CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_Msk (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_CAPTURE_0 : (CAPTURE_COMPARE_TIMER Offset: 0x10) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. -------- */

typedef union
{
  struct
  {
    uint32_t CAPTURE_0:32;              /**< bit:  0..31  This register saves the value copied from the Free Running timer on a programmed edge of ICT0. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_CAPTURE_0_bits_t;
#define CAPTURE_COMPARE_TIMER_CAPTURE_0_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_CAPTURE_0) This register saves the value copied from the Free Running timer on a programmed edge of ICT0.  Reset Value */

#define CAPTURE_COMPARE_TIMER_CAPTURE_0_CAPTURE_0_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_0) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_0_CAPTURE_0_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_CAPTURE_0_CAPTURE_0_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_0) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_0_CAPTURE_0(value) (CAPTURE_COMPARE_TIMER_CAPTURE_0_CAPTURE_0_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_0_CAPTURE_0_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_0_Msk   (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_CAPTURE_0) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_CAPTURE_1 : (CAPTURE_COMPARE_TIMER Offset: 0x14) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. -------- */

typedef union
{
  struct
  {
    uint32_t CAPTURE_1:32;              /**< bit:  0..31  This register saves the value copied from the Free Running timer on a programmed edge of ICT1. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_CAPTURE_1_bits_t;
#define CAPTURE_COMPARE_TIMER_CAPTURE_1_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_CAPTURE_1) This register saves the value copied from the Free Running timer on a programmed edge of ICT1.  Reset Value */

#define CAPTURE_COMPARE_TIMER_CAPTURE_1_CAPTURE_1_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_1) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_1_CAPTURE_1_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_CAPTURE_1_CAPTURE_1_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_1) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_1_CAPTURE_1(value) (CAPTURE_COMPARE_TIMER_CAPTURE_1_CAPTURE_1_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_1_CAPTURE_1_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_1_Msk   (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_CAPTURE_1) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_CAPTURE_2 : (CAPTURE_COMPARE_TIMER Offset: 0x18) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. -------- */

typedef union
{
  struct
  {
    uint32_t CAPTURE_2:32;              /**< bit:  0..31  This register saves the value copied from the Free Running timer on a programmed edge of ICT2. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_CAPTURE_2_bits_t;
#define CAPTURE_COMPARE_TIMER_CAPTURE_2_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_CAPTURE_2) This register saves the value copied from the Free Running timer on a programmed edge of ICT0.  Reset Value */

