ranjithaguna/pv/LED_Demo/source/pic32cx/component/capture_compare_timer.h
#define CAPTURE_COMPARE_TIMER_CAPTURE_2_CAPTURE_2_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_2) This register saves the value copied from the Free Running timer on a programmed edge of ICT2. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_2_CAPTURE_2_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_CAPTURE_2_CAPTURE_2_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_2) This register saves the value copied from the Free Running timer on a programmed edge of ICT2. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_2_CAPTURE_2(value) (CAPTURE_COMPARE_TIMER_CAPTURE_2_CAPTURE_2_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_2_CAPTURE_2_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_2_Msk   (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_CAPTURE_2) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_CAPTURE_3 : (CAPTURE_COMPARE_TIMER Offset: 0x1c) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. -------- */

typedef union
{
  struct
  {
    uint32_t CAPTURE_3:32;              /**< bit:  0..31  This register saves the value copied from the Free Running timer on a programmed edge of ICT3. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_CAPTURE_3_bits_t;
#define CAPTURE_COMPARE_TIMER_CAPTURE_3_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_CAPTURE_3) This register saves the value copied from the Free Running timer on a programmed edge of ICT0.  Reset Value */

#define CAPTURE_COMPARE_TIMER_CAPTURE_3_CAPTURE_3_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_3) This register saves the value copied from the Free Running timer on a programmed edge of ICT3. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_3_CAPTURE_3_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_CAPTURE_3_CAPTURE_3_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_3) This register saves the value copied from the Free Running timer on a programmed edge of ICT3. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_3_CAPTURE_3(value) (CAPTURE_COMPARE_TIMER_CAPTURE_3_CAPTURE_3_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_3_CAPTURE_3_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_3_Msk   (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_CAPTURE_3) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_CAPTURE_4 : (CAPTURE_COMPARE_TIMER Offset: 0x20) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. -------- */

typedef union
{
  struct
  {
    uint32_t CAPTURE_4:32;              /**< bit:  0..31  This register saves the value copied from the Free Running timer on a programmed edge of ICT4. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_CAPTURE_4_bits_t;
#define CAPTURE_COMPARE_TIMER_CAPTURE_4_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_CAPTURE_4) This register saves the value copied from the Free Running timer on a programmed edge of ICT4.  Reset Value */

#define CAPTURE_COMPARE_TIMER_CAPTURE_4_CAPTURE_4_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_4) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_4_CAPTURE_4_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_CAPTURE_4_CAPTURE_4_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_4) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_4_CAPTURE_4(value) (CAPTURE_COMPARE_TIMER_CAPTURE_4_CAPTURE_4_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_4_CAPTURE_4_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_4_Msk   (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_CAPTURE_4) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_CAPTURE_5 : (CAPTURE_COMPARE_TIMER Offset: 0x24) (R/W 32) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. -------- */

typedef union
{
  struct
  {
    uint32_t CAPTURE_5:32;              /**< bit:  0..31  This register saves the value copied from the Free Running timer on a programmed edge of ICT5. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_CAPTURE_5_bits_t;
#define CAPTURE_COMPARE_TIMER_CAPTURE_5_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_CAPTURE_5) This register saves the value copied from the Free Running timer on a programmed edge of ICT5.  Reset Value */

#define CAPTURE_COMPARE_TIMER_CAPTURE_5_CAPTURE_5_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_CAPTURE_5) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. Position */
#define CAPTURE_COMPARE_TIMER_CAPTURE_5_CAPTURE_5_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_CAPTURE_5_CAPTURE_5_Pos)  /**< (CAPTURE_COMPARE_TIMER_CAPTURE_5) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. Mask */
#define CAPTURE_COMPARE_TIMER_CAPTURE_5_CAPTURE_5(value) (CAPTURE_COMPARE_TIMER_CAPTURE_5_CAPTURE_5_Msk & ((value) << CAPTURE_COMPARE_TIMER_CAPTURE_5_CAPTURE_5_Pos))
#define CAPTURE_COMPARE_TIMER_CAPTURE_5_Msk   (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_CAPTURE_5) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_COMPARE_0 : (CAPTURE_COMPARE_TIMER Offset: 0x28) (R/W 32) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. -------- */

typedef union
{
  struct
  {
    uint32_t COMPARE_0:32;              /**< bit:  0..31  A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_COMPARE_0_bits_t;
#define CAPTURE_COMPARE_TIMER_COMPARE_0_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_COMPARE_0) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer.  Reset Value */

#define CAPTURE_COMPARE_TIMER_COMPARE_0_COMPARE_0_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_COMPARE_0) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. Position */
#define CAPTURE_COMPARE_TIMER_COMPARE_0_COMPARE_0_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_COMPARE_0_COMPARE_0_Pos)  /**< (CAPTURE_COMPARE_TIMER_COMPARE_0) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. Mask */
#define CAPTURE_COMPARE_TIMER_COMPARE_0_COMPARE_0(value) (CAPTURE_COMPARE_TIMER_COMPARE_0_COMPARE_0_Msk & ((value) << CAPTURE_COMPARE_TIMER_COMPARE_0_COMPARE_0_Pos))
#define CAPTURE_COMPARE_TIMER_COMPARE_0_Msk   (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_COMPARE_0) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_COMPARE_1 : (CAPTURE_COMPARE_TIMER Offset: 0x2c) (R/W 32) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. -------- */

typedef union
{
  struct
  {
    uint32_t COMPARE_1:32;              /**< bit:  0..31  A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_COMPARE_1_bits_t;
#define CAPTURE_COMPARE_TIMER_COMPARE_1_RESETVALUE (0x00U)                                       /**<  (CAPTURE_COMPARE_TIMER_COMPARE_1) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer.  Reset Value */

#define CAPTURE_COMPARE_TIMER_COMPARE_1_COMPARE_1_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_COMPARE_1) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. Position */
#define CAPTURE_COMPARE_TIMER_COMPARE_1_COMPARE_1_Msk (0xFFFFFFFFU << CAPTURE_COMPARE_TIMER_COMPARE_1_COMPARE_1_Pos)  /**< (CAPTURE_COMPARE_TIMER_COMPARE_1) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. Mask */
#define CAPTURE_COMPARE_TIMER_COMPARE_1_COMPARE_1(value) (CAPTURE_COMPARE_TIMER_COMPARE_1_COMPARE_1_Msk & ((value) << CAPTURE_COMPARE_TIMER_COMPARE_1_COMPARE_1_Pos))
#define CAPTURE_COMPARE_TIMER_COMPARE_1_Msk   (0xFFFFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_COMPARE_1) Register Mask  */

/* -------- CAPTURE_COMPARE_TIMER_ICT_MUX_SEL : (CAPTURE_COMPARE_TIMER Offset: 0x30) (R/W 32) This register selects the pin mapping to the capture register. -------- */

typedef union
{
  struct
  {
    uint32_t MUX_SEL_CAP0:4;            /**< bit:   0..3  Mux Select for Capture 0 register.            */
    uint32_t MUX_SEL_CAP1:4;            /**< bit:   4..7  Mux Select for Capture 1 register.            */
    uint32_t MUX_SEL_CAP2:4;            /**< bit:  8..11  Mux Select for Capture 2 register.            */
    uint32_t MUX_SEL_CAP3:4;            /**< bit: 12..15  Mux Select for Capture 3 register.            */
    uint32_t MUX_SEL_CAP4:4;            /**< bit: 16..19  Mux Select for Capture 4 register.            */
    uint32_t MUX_SEL_CAP5:4;            /**< bit: 20..23  Mux Select for Capture 5 register.            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_bits_t;
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_RESETVALUE (0x543210U)                                   /**<  (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) This register selects the pin mapping to the capture register.  Reset Value */

#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP0_Pos (0)                                            /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 0 register. Position */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP0_Msk (0xFU << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP0_Pos)  /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 0 register. Mask */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP0(value) (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP0_Msk & ((value) << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP0_Pos))
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP1_Pos (4)                                            /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 1 register. Position */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP1_Msk (0xFU << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP1_Pos)  /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 1 register. Mask */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP1(value) (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP1_Msk & ((value) << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP1_Pos))
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP2_Pos (8)                                            /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 2 register. Position */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP2_Msk (0xFU << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP2_Pos)  /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 2 register. Mask */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP2(value) (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP2_Msk & ((value) << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP2_Pos))
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP3_Pos (12)                                           /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 3 register. Position */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP3_Msk (0xFU << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP3_Pos)  /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 3 register. Mask */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP3(value) (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP3_Msk & ((value) << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP3_Pos))
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP4_Pos (16)                                           /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 4 register. Position */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP4_Msk (0xFU << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP4_Pos)  /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 4 register. Mask */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP4(value) (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP4_Msk & ((value) << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP4_Pos))
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP5_Pos (20)                                           /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 5 register. Position */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP5_Msk (0xFU << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP5_Pos)  /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Mux Select for Capture 5 register. Mask */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP5(value) (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP5_Msk & ((value) << CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_MUX_SEL_CAP5_Pos))
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_Msk (0x00FFFFFFUL)                                 /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) Register Mask  */

/** \brief CAPTURE_COMPARE_TIMER register offsets definitions */
#define CAPTURE_COMPARE_TIMER_CONTROL_OFFSET (0x00)         /**< (CAPTURE_COMPARE_TIMER_CONTROL) This register controls the capture and compare timer. Offset */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_0_OFFSET (0x04)         /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_0) This register is used to configure capture and compare timers 0-3. Offset */
#define CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_OFFSET (0x08)         /**< (CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1) This register is used to configure capture and compare timers 4-5. Offset */
#define CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_OFFSET (0x0C)         /**< (CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER) This register contains the current value of the Free Running Timer. Offset */
#define CAPTURE_COMPARE_TIMER_CAPTURE_0_OFFSET (0x10)         /**< (CAPTURE_COMPARE_TIMER_CAPTURE_0) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Offset */
#define CAPTURE_COMPARE_TIMER_CAPTURE_1_OFFSET (0x14)         /**< (CAPTURE_COMPARE_TIMER_CAPTURE_1) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. Offset */
#define CAPTURE_COMPARE_TIMER_CAPTURE_2_OFFSET (0x18)         /**< (CAPTURE_COMPARE_TIMER_CAPTURE_2) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Offset */
#define CAPTURE_COMPARE_TIMER_CAPTURE_3_OFFSET (0x1C)         /**< (CAPTURE_COMPARE_TIMER_CAPTURE_3) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. Offset */
#define CAPTURE_COMPARE_TIMER_CAPTURE_4_OFFSET (0x20)         /**< (CAPTURE_COMPARE_TIMER_CAPTURE_4) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. Offset */
#define CAPTURE_COMPARE_TIMER_CAPTURE_5_OFFSET (0x24)         /**< (CAPTURE_COMPARE_TIMER_CAPTURE_5) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. Offset */
#define CAPTURE_COMPARE_TIMER_COMPARE_0_OFFSET (0x28)         /**< (CAPTURE_COMPARE_TIMER_COMPARE_0) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. Offset */
#define CAPTURE_COMPARE_TIMER_COMPARE_1_OFFSET (0x2C)         /**< (CAPTURE_COMPARE_TIMER_COMPARE_1) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. Offset */
#define CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_OFFSET (0x30)         /**< (CAPTURE_COMPARE_TIMER_ICT_MUX_SEL) This register selects the pin mapping to the capture register. Offset */

/** \brief CAPTURE_COMPARE_TIMER register API structure */
typedef struct
{  /* This is a 16-bit auto-reloading timer/counter. */
  __IO  __CAPTURE_COMPARE_TIMER_CONTROL_bits_t CAPTURE_COMPARE_TIMER_CONTROL; /**< Offset: 0x00 (R/W  32) This register controls the capture and compare timer. */
  __IO  __CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_0_bits_t CAPTURE_CONTROL_0; /**< Offset: 0x04 (R/W  32) This register is used to configure capture and compare timers 0-3. */
  __IO  __CAPTURE_COMPARE_TIMER_CAPTURE_CONTROL_1_bits_t CAPTURE_CONTROL_1; /**< Offset: 0x08 (R/W  32) This register is used to configure capture and compare timers 4-5. */
  __IO  __CAPTURE_COMPARE_TIMER_FREE_RUNNING_TIMER_bits_t FREE_RUNNING_TIMER; /**< Offset: 0x0C (R/W  32) This register contains the current value of the Free Running Timer. */
  __IO  __CAPTURE_COMPARE_TIMER_CAPTURE_0_bits_t CAPTURE_0;     /**< Offset: 0x10 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. */
  __IO  __CAPTURE_COMPARE_TIMER_CAPTURE_1_bits_t CAPTURE_1;     /**< Offset: 0x14 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT1. */
  __IO  __CAPTURE_COMPARE_TIMER_CAPTURE_2_bits_t CAPTURE_2;     /**< Offset: 0x18 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. */
  __IO  __CAPTURE_COMPARE_TIMER_CAPTURE_3_bits_t CAPTURE_3;     /**< Offset: 0x1C (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT0. */
  __IO  __CAPTURE_COMPARE_TIMER_CAPTURE_4_bits_t CAPTURE_4;     /**< Offset: 0x20 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT4. */
  __IO  __CAPTURE_COMPARE_TIMER_CAPTURE_5_bits_t CAPTURE_5;     /**< Offset: 0x24 (R/W  32) This register saves the value copied from the Free Running timer on a programmed edge of ICT5. */
  __IO  __CAPTURE_COMPARE_TIMER_COMPARE_0_bits_t COMPARE_0;     /**< Offset: 0x28 (R/W  32) A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer. */
  __IO  __CAPTURE_COMPARE_TIMER_COMPARE_1_bits_t COMPARE_1;     /**< Offset: 0x2C (R/W  32) A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer. */
  __IO  __CAPTURE_COMPARE_TIMER_ICT_MUX_SEL_bits_t ICT_MUX_SEL;   /**< Offset: 0x30 (R/W  32) This register selects the pin mapping to the capture register. */
} capturecomparetimer_registers_t;
/** @}  end of This is a 16-bit auto-reloading timer/counter. */

#endif /* _PIC32CX_0525SG12_CAPTURE_COMPARE_TIMER_COMPONENT_H_ */
